bolknote/MK61S_MINI/tests/mk_math_self_test.cpp
  const char* endp = nullptr;
  check_near("atof int", mk_math::atof("123"), 123.0, 1e-9);
  check_near("atof frac", mk_math::atof("3.14159"), 3.14159, 1e-9);
  check_near("atof sci", mk_math::atof("-1.5e3"), -1500.0, 1e-9);
  check_near("atof huge int", mk_math::atof("123456789012345678901"), 1.2345678901234568e20, 1e-15);
  check_near("atof leading 0", mk_math::atof("0.00000000000000000000125"), 1.25e-21, 1e-15);
  check_true("atof equivalent register one",
             mk_math::atof("1.0000000e+00") == mk_math::atof("1"));
  check_true("atof equivalent register fraction",
             mk_math::atof("0.1000000e+00") == mk_math::atof("0.1"));
  check_true("atof equivalent register eighty",
             mk_math::atof("8.0000000e+01") == mk_math::atof("80"));
  check_true("atof overflow", mk_math::is_inf(mk_math::atof("1e999999")));
  check_true("atof underflow", mk_math::atof("1e-999999") == 0.0);
  check_true("atof zero huge", mk_math::atof("0e999999") == 0.0);
  double v = mk_math::strtod("42.5abc", &endp);
  check_near("strtod value", v, 42.5, 1e-9);
  check_true("strtod endptr", endp != nullptr && *endp == 'a');
  check_true("trunc NaN", mk_math::is_nan(mk_math::trunc(__builtin_nan(""))));
  check_true("floor +Inf", mk_math::is_inf(mk_math::floor(__builtin_huge_val())));
  check_true("pow10 subnormal", mk_math::pow10_int(-309) > 0.0);
  check_true("log10 invalid", mk_math::log10_floor(0.0) == 0);

  const char* huge_end = nullptr;
  const double huge = mk_math::strtod("1e999999999999999999999", &huge_end);
  check_true("strtod huge", std::isinf(huge));
  check_true("strtod huge end", huge_end != nullptr && *huge_end == 0);
  check_true("strtod zero huge", mk_math::atof("0e999999999999999999999") == 0.0);
  check_true("strtod denormal", mk_math::atof("4.940656458e-324") == std::numeric_limits<double>::denorm_min());
  check_near("strtod 20 digits", mk_math::strtod("12345678901234567890", nullptr), 1.2345678901234567e19, 1e-15);
  check_near("strtod long fraction", mk_math::atof("0.1234567890123456789012345"),
             0.12345678901234568, 1e-15);
}

static void test_transcendental(void) {
  std::printf("CORE transcendental vs libm (tol 1e-6):\n");
  const double tol = 1e-6;

  // The Flash-only test build does not run the SRAM-cache test which happens
  // to initialize the calculator.  Keep this test independent from build
  // options: eval_unary() deliberately refuses to snapshot an uninitialized
  // core whose internal table/ring pointers are still null.
  core_61::enable();

  check_near("sin(1)",   mk_math::sin(1.0),   std::sin(1.0),   tol);
  check_near("sin(-0.7)",mk_math::sin(-0.7),  std::sin(-0.7),  tol);
  check_near("cos(1)",   mk_math::cos(1.0),   std::cos(1.0),   tol);
  check_near("cos(2)",   mk_math::cos(2.0),   std::cos(2.0),   tol);
  check_near("tan(0.5)", mk_math::tan(0.5),   std::tan(0.5),   tol);
  check_near("asin(.5)", mk_math::asin(0.5),  std::asin(0.5),  tol);
  check_near("acos(.5)", mk_math::acos(0.5),  std::acos(0.5),  tol);
  check_near("atan(.5)", mk_math::atan(0.5),  std::atan(0.5),  tol);
  check_near("ln(2)",    mk_math::ln(2.0),    std::log(2.0),   tol);
  check_near("ln(10)",   mk_math::ln(10.0),   std::log(10.0),  tol);
  check_near("log10(100)",mk_math::log10(100.0), std::log10(100.0), tol);
  check_near("exp(1)",   mk_math::exp(1.0),   std::exp(1.0),   tol);
  check_near("exp(-2)",  mk_math::exp(-2.0),  std::exp(-2.0),  tol);
  check_near("sqrt(2)",  mk_math::sqrt(2.0),  std::sqrt(2.0),  tol);
  check_near("sqrt(1024)",mk_math::sqrt(1024.0), 32.0,         tol);

  check_near("pow(2,10)", mk_math::pow(2.0, 10.0), 1024.0,      tol);
  check_near("pow(1.5,3)",mk_math::pow(1.5, 3.0),  std::pow(1.5, 3.0), tol);
  check_near("pow(4,0.5)",mk_math::pow(4.0, 0.5),  2.0,         tol);
  check_near("pow(x,0)",  mk_math::pow(7.0, 0.0),  1.0,         tol);
  check_near("pow(-2,3)", mk_math::pow(-2.0, 3.0), -8.0,        tol);

  check_true("sqrt domain", mk_math::is_nan(mk_math::sqrt(-4.0)));
  check_true("ln domain", mk_math::is_nan(mk_math::ln(-1.0)));
  check_true("asin domain", mk_math::is_nan(mk_math::asin(2.0)));
  check_true("input overflow", mk_math::is_nan(mk_math::sin(1e100)));
  check_true("non-finite input", mk_math::is_nan(mk_math::cos(__builtin_huge_val())));
}

static void test_authentic_core_smoke(void) {
  std::printf("authentic ROM/core arithmetic smoke:\n");
  core_61::set_expanded_program_mode(false);
  core_61::enable();
  MK61Emu_SetAngleUnit(DEGREE);

  const MatrixKey key_2 = {4, 1};
  const MatrixKey key_3 = {5, 1};
  const MatrixKey key_enter = {11, 8};
  const MatrixKey key_add = {2, 8};
  press_matrix(key_2);
  press_matrix(key_enter);
  press_matrix(key_3);
  press_matrix(key_add);
  check_near("2 ENTER 3 +", read_live_x(), 5.0, 1e-8);
}

static void test_extended_prefixes(void) {
  std::printf("expanded far-address and display prefixes:\n");
  static const u8 prefixes[] = {0x1FU, 0x2FU};
  for(u8 prefix : prefixes) {
    core_61::set_expanded_program_mode(false);
    core_61::enable();
    const u8 classic[] = {prefix, 0x07, 0x50};
    run_program(classic, sizeof(classic));
    check_near("classic prefix remains ROM command", read_live_x(), 7.0, 1e-8);
    check_true("classic prefix does not select bank",
        core_61::active_program_bank() == 0 &&
        !core_61::extended_program_error());
  }
  static const u8 native_conditions[] = {0x57, 0x59, 0x5C, 0x5E};
  for(u8 opcode : native_conditions) {
    for(u8 index = 0; index < 3; ++index) {
      core_61::set_expanded_program_mode(false);
      core_61::enable();
      if(index == 2) {
        char minus_one[8] = {'1','0','0','0','0','0','0','0'};
        write_stack_register(stack::X, '-', minus_one, 0);
      } else {
        press_matrix(digit_key(index));
      }
      const u8 native_condition[] = {opcode, 0x04, 0x07, 0x50, 0x08, 0x50};
      run_program(native_condition, sizeof(native_condition));
      const bool native_branches = core_61::get_IP() == 6;
      check_true("native condition reference",
          core_61::is_CALC() &&
          (native_branches || core_61::get_IP() == 4));

      core_61::set_expanded_program_mode(true);
      core_61::enable();
      core_61::clear_extended_program_banks();
      if(index == 2) {
        char minus_one[8] = {'1','0','0','0','0','0','0','0'};
        write_stack_register(stack::X, '-', minus_one, 0);
      } else {
        press_matrix(digit_key(index));
      }
      check_true("write far condition target",
          core_61::write_absolute_program(250, 0x50));
      const u8 far_condition[] = {0x1F, opcode, 0x02, 0x50, 0x50};
      run_program(far_condition, sizeof(far_condition));
      check_true("far condition matches ROM",
          core_61::active_program_bank() == (native_branches ? 2U : 0U) &&
          !core_61::extended_program_error());
    }
  }
  for(u8 value = 1; value <= 3; ++value) {
    core_61::set_expanded_program_mode(false);
    core_61::enable();
    store_direct(0, value);
    const u8 native_loop[] = {0x5D, 0x04, 0x07, 0x50, 0x08, 0x50};
    run_program(native_loop, sizeof(native_loop));
    const bool native_branches = core_61::get_IP() == 6;
    core_61::set_expanded_program_mode(true);
    core_61::enable();
    core_61::clear_extended_program_banks();
    store_direct(0, value);
    check_true("write far loop target",
        core_61::write_absolute_program(250, 0x50));
    const u8 far_loop[] = {0x1F, 0x5D, 0x02, 0x50, 0x50};
    run_program(far_loop, sizeof(far_loop));
    char reg[15] = {};
    MK61Emu_ReadRegister(0, reg, SYMBOLS);
    check_true("far FL0 matches ROM branch",
        core_61::active_program_bank() == (native_branches ? 2U : 0U) &&
        !core_61::extended_program_error());
    check_true("far FL0 counter value",
        reg[1] == (char) ('0' + (value == 1 ? 1 : value - 1)) &&
        reg[12] == '0' && reg[13] == '0');
  }
  core_61::set_expanded_program_mode(true);
  core_61::enable();
  core_61::clear_extended_program_banks();
  store_direct(0, 0);
  const u8 zero_loop[] = {0x1F, 0x5D, 0x02, 0x50, 0x50};
  run_program(zero_loop, sizeof(zero_loop));
  check_true("far FL0 zero counter is rejected",
      core_61::is_CALC() && core_61::extended_program_error());
  core_61::set_expanded_program_mode(true);
  static const u8 prefix_operands[] = {0x1FU, 0x2FU};
  for(u8 operand : prefix_operands) {
    core_61::enable();
    core_61::clear_extended_program_banks();
    const u8 target = operand == 0x1FU ? 25U : 35U;
    ProgramBoundaryProbe probe = {};
    check_true("operand boundary hook installed",
        core_61::set_mk61_program_boundary_hook(
            &program_boundary_probe, &probe));
    u8 branch_with_prefix_operand[37] = {};
    for(u8& code : branch_with_prefix_operand) code = 0x50;
    branch_with_prefix_operand[0] = 0x51;
    branch_with_prefix_operand[1] = operand;
    branch_with_prefix_operand[target] = 0x07;
    run_program(branch_with_prefix_operand, sizeof(branch_with_prefix_operand));
    check_true("1F/2F operand is not an opcode",
        probe.calls == 3 &&
        probe.addresses[0] == 0 && probe.opcodes[0] == 0x51 &&
        probe.addresses[1] == target && probe.opcodes[1] == 0x07 &&
        probe.addresses[2] == target + 1U && probe.opcodes[2] == 0x50 &&
        !core_61::extended_program_error());
    check_near("operand fall-through result", read_live_x(), 7.0, 1e-8);
    core_61::clear_mk61_program_boundary_hook();

    core_61::enable();
    core_61::clear_extended_program_banks();
    u8 call_with_prefix_operand[37] = {};
    for(u8& code : call_with_prefix_operand) code = 0x50;
    call_with_prefix_operand[0] = 0x53;
    call_with_prefix_operand[1] = operand;
    call_with_prefix_operand[2] = 0x07;
    call_with_prefix_operand[target] = 0x08;
    call_with_prefix_operand[target + 1U] = 0x52;
    probe = {};
    check_true("CALL operand hook installed",
        core_61::set_mk61_program_boundary_hook(
            &program_boundary_probe, &probe));
    run_program(call_with_prefix_operand, sizeof(call_with_prefix_operand));
    check_true("1F/2F CALL operand retains ROM address",
        probe.calls == 5 &&
        probe.addresses[0] == 0 && probe.opcodes[0] == 0x53 &&
        probe.addresses[1] == target && probe.opcodes[1] == 0x08 &&
        probe.addresses[2] == target + 1U && probe.opcodes[2] == 0x52 &&
        probe.addresses[3] == 2 && probe.opcodes[3] == 0x07 &&
        probe.addresses[4] == 3 && probe.opcodes[4] == 0x50 &&
        !core_61::extended_program_error());
    core_61::clear_mk61_program_boundary_hook();
  }
  core_61::enable();
  core_61::clear_extended_program_banks();
  const u8 jump[] = {0x1F, 0x51, 0x02, 0x50, 0x50};
  check_true("write far bank", core_61::write_absolute_program(250, 0x07) &&
      core_61::write_absolute_program(251, 0x50));
  run_program(jump, sizeof(jump));
  check_true("far jump reaches bank 2", core_61::active_program_bank() == 2);
  check_near("far jump result", read_live_x(), 7.0, 1e-8);
  check_true("far jump no error", !core_61::extended_program_error());

  core_61::enable();
  core_61::clear_extended_program_banks();
  u8 highest_opcode = 0;
  check_true("highest absolute address is writable",
      core_61::write_absolute_program(9999, 0x07) &&
      core_61::read_absolute_program(9999, highest_opcode) &&
      highest_opcode == 0x07);
  core_61::clear_extended_program_banks();
  check_true("clear releases distant bank storage",
      core_61::read_absolute_program(9999, highest_opcode) &&
      highest_opcode == 0x50 &&
      core_61::write_absolute_program(9999, 0x08));

  core_61::enable();
  core_61::clear_extended_program_banks();
  u8 populated_far_banks = 0;
  for(u16 bank = 1; bank <= 31; ++bank) {
    if(core_61::write_absolute_program(
           (u16) (bank * core_61::MAX_PROGRAM_STEP), 0x07))
      populated_far_banks++;
  }
  check_true("32 bank slots include active bank",
      populated_far_banks == 31 &&
      !core_61::write_absolute_program(
          (u16) (32U * core_61::MAX_PROGRAM_STEP), 0x07));
  const u8 full_pool_jump[] = {0x1F, 0x51, 0x34, 0x72, 0x50};
  run_program(full_pool_jump, sizeof(full_pool_jump));
  check_true("full bank pool still runs populated bank",
      core_61::active_program_bank() == 31 &&
      !core_61::extended_program_error());
  check_near("full bank pool result", read_live_x(), 7.0, 1e-8);

  core_61::enable();
  core_61::clear_extended_program_banks();
  u8 edge_page[core_61::CODE_PAGE_BUFFER_SIZE] = {};
  for(usize index = 0; index < core_61::MAX_PROGRAM_STEP; ++index)
    edge_page[index] = 0x50;
  edge_page[110] = 0x1F;
  edge_page[111] = 0x51;
  core_61::set_code_page(edge_page);
  check_true("write cross-bank prefix operands",
      core_61::write_absolute_program(112, 0x02) &&
      core_61::write_absolute_program(113, 0x50) &&
      core_61::write_absolute_program(250, 0x07) &&
      core_61::write_absolute_program(251, 0x50));
  core_61::set_IP(110);
  press_matrix({2, 9});
  for(int index = 0; index < 256 && core_61::is_RUN(); ++index)
    core_61::step();
  check_true("far prefix crosses 112-byte boundary",
      core_61::active_program_bank() == 2 &&
      !core_61::extended_program_error());
  check_near("cross-bank far result", read_live_x(), 7.0, 1e-8);

  core_61::enable();
  core_61::clear_extended_program_banks();
  check_true("write bank-local K2",
      core_61::write_absolute_program(224, 0x56) &&
      core_61::write_absolute_program(225, 0x01));
  set_ms_program_byte(0, 0x54);
  set_ms_program_byte(1, 0x50);
  const u8 bank_exchange[] = {0x1F, 0x51, 0x02, 0x24, 0x50};
  run_program(bank_exchange, sizeof(bank_exchange));
  u8 bank_code = 0;
  u8 root_code = 0;
  check_true("K2 exchanges current far bank",
      core_61::active_program_bank() == 2 &&
      core_61::read_absolute_program(224, bank_code) &&
      core_61::read_absolute_program(0, root_code) &&
      bank_code == 0x54 && root_code == 0x1F &&
      get_ms_program_byte(0) == 0x56);

  core_61::set_expanded_program_mode(true);
  core_61::enable();
  core_61::clear_extended_program_banks();
  const u8 call[] = {0x1F, 0x53, 0x01, 0x20, 0x50};
  check_true("write far subroutine", core_61::write_absolute_program(120, 0x07) &&
      core_61::write_absolute_program(121, 0x52));
  run_program(call, sizeof(call));
  check_true("far return reaches bank 0", core_61::active_program_bank() == 0);
  check_near("far call result", read_live_x(), 7.0, 1e-8);
  check_true("far call no error", !core_61::extended_program_error());

  core_61::enable();
  core_61::clear_extended_program_banks();
  check_true("write mixed near/far calls",
      core_61::write_absolute_program(112, 0x53) &&
      core_61::write_absolute_program(113, 0x10) &&
      core_61::write_absolute_program(114, 0x52) &&
      core_61::write_absolute_program(122, 0x07) &&
      core_61::write_absolute_program(123, 0x52));
  const u8 mixed_calls[] = {0x1F, 0x53, 0x01, 0x12, 0x50};
  run_program(mixed_calls, sizeof(mixed_calls));
  check_true("mixed near/far returns unwind",
      core_61::active_program_bank() == 0 &&
      !core_61::extended_program_error());
  check_near("mixed calls result", read_live_x(), 7.0, 1e-8);

