bolknote/MK61S_MINI/tests/mk_math_self_test.cpp
  // Ten levels cross more banks than the original calculator's return stack
  // can hold; every ordinary RET must return after the entire 1F sequence.
  core_61::enable();
  core_61::clear_extended_program_banks();
  for(u16 bank = 1; bank <= 10; ++bank) {
    const u16 address = (u16) (bank * core_61::MAX_PROGRAM_STEP);
    if(bank == 10) {
      check_true("write deepest subroutine",
          core_61::write_absolute_program(address, 0x07) &&
          core_61::write_absolute_program((u16) (address + 1U), 0x52));
      continue;
    }
    const u16 target = (u16) ((bank + 1U) * core_61::MAX_PROGRAM_STEP);
    const u8 high = (u8) (((target / 1000U) << 4) | ((target / 100U) % 10U));
    const u8 low = (u8) ((((target / 10U) % 10U) << 4) | (target % 10U));
    check_true("write nested far subroutine",
        core_61::write_absolute_program(address, 0x1F) &&
        core_61::write_absolute_program((u16) (address + 1U), 0x53) &&
        core_61::write_absolute_program((u16) (address + 2U), high) &&
        core_61::write_absolute_program((u16) (address + 3U), low) &&
        core_61::write_absolute_program((u16) (address + 4U), 0x52));
  }
  const u8 deep_call[] = {0x1F, 0x53, 0x01, 0x12, 0x50};
  run_program(deep_call, sizeof(deep_call));
  check_true("nested far calls unwind to bank 0",
      core_61::active_program_bank() == 0 && !core_61::extended_program_error());
  check_near("nested far call result", read_live_x(), 7.0, 1e-8);

  core_61::enable();
  core_61::clear_extended_program_banks();
  const u8 conditional[] = {0x1F, 0x57, 0x02, 0x50, 0x50};
  check_true("write far conditional target",
      core_61::write_absolute_program(250, 0x50));
  set_x_bcd(0x00000001U);
  run_program(conditional, sizeof(conditional));
  check_true("far x!=0 continues", core_61::active_program_bank() == 0);

  core_61::enable();
  core_61::clear_extended_program_banks();
  set_x_bcd(0x00000000U);
  run_program(conditional, sizeof(conditional));
  check_true("far x!=0 takes operand on zero",
      core_61::active_program_bank() == 2);

  core_61::enable();
  core_61::clear_extended_program_banks();
  char address_mantissa[8] = {'2','5','0','0','0','0','0','0'};
  write_stack_register(stack::X, ' ', address_mantissa, 2);
  press_matrix({6, 9}); // X -> R
  press_matrix(digit_key(0));
  check_near("far indirect register input", read_live_x(), 250.0, 1e-8);
  check_true("write far indirect target",
      core_61::write_absolute_program(249, 0x07) &&
      core_61::write_absolute_program(250, 0x50));
  const u8 indirect[] = {0x1F, 0x80, 0x50};
  run_program(indirect, sizeof(indirect));
  check_true("far indirect reaches bank 2",
      core_61::active_program_bank() == 2 && !core_61::extended_program_error());
  check_near("far indirect result", read_live_x(), 7.0, 1e-8);

  core_61::enable();
  core_61::clear_extended_program_banks();
  set_x_bcd(0x00000007U);
  const u8 display[] = {0x2F, 0x01, 0x2F, 0x2A, 0x2F, 0x0E, 0x50};
  run_program(display, sizeof(display));
  const u8* frame = core_61::segment_display_frame();
  check_true("segment mode active", frame != nullptr);
  check_true("segment strobe stores X", frame != nullptr && frame[1] == 7);
  check_true("segment strobe advances", core_61::extended_display_cursor() == 2);
  check_near("segment strobe leaves X", read_live_x(), 7.0, 1e-8);
  check_true("segment command no error", !core_61::extended_program_error());

  core_61::enable();
  core_61::clear_extended_program_banks();
  const char mask_mantissa[8] = {'2','5','5','0','0','0','0','0'};
  write_stack_register(stack::X, ' ', mask_mantissa, 2);
  const u8 sign_segments[] = {0x2F, 0x2A, 0x2F, 0x0E, 0x50};
  run_program(sign_segments, sizeof(sign_segments));
  frame = core_61::segment_display_frame();
  check_true("sign position accepts all eight segment bits",
      frame != nullptr && frame[0] == 0xFF &&
      core_61::extended_display_cursor() == 1 &&
      !core_61::extended_program_error());
  check_near("sign mask leaves X", read_live_x(), 255.0, 1e-8);

  core_61::enable();
  core_61::clear_extended_program_banks();
  set_x_bcd(0x00000007U);
  run_program(display, sizeof(display));
  core_61::ContextBuffer display_snapshot = {};
  check_true("save segmented display context",
      core_61::save_context(display_snapshot));
  core_61::enable();
  check_true("restore segmented display context",
      core_61::restore_context(display_snapshot));
  frame = core_61::segment_display_frame();
  check_true("segment frame survives context lease",
      frame != nullptr && frame[1] == 7 &&
      core_61::extended_display_cursor() == 2);

  core_61::enable();
  core_61::clear_extended_program_banks();
  const u8 automatic[] = {0x2F, 0x01, 0x2F, 0x2A, 0x07, 0x50};
  run_program(automatic, sizeof(automatic));
  frame = core_61::segment_display_frame();
  check_true("segment auto follows X", frame != nullptr && frame[1] == 7);

  core_61::enable();
  core_61::clear_extended_program_banks();
  const u8 held[] = {0x2F, 0x01, 0x2F, 0x2A, 0x2F, 0x50, 0x07, 0x50};
  run_program(held, sizeof(held));
  frame = core_61::segment_display_frame();
  check_true("segment hold ignores later X", frame != nullptr && frame[1] == 0);
  check_near("hold leaves arithmetic X", read_live_x(), 7.0, 1e-8);

  core_61::enable();
  core_61::clear_extended_program_banks();
  const u8 numeric_strobe[] = {0x2F, 0x50, 0x07, 0x2F, 0x0E, 0x50};
  run_program(numeric_strobe, sizeof(numeric_strobe));
  char indicator[INDICATOR_STRING_LENGTH] = {};
  (void) core_61::update_indicator(indicator, SYMBOLS);
  check_true("numeric hold strobe publishes X",
      !core_61::extended_display_auto() && std::strchr(indicator, '7') != nullptr);
  check_near("numeric strobe leaves X", read_live_x(), 7.0, 1e-8);

  core_61::enable();
  core_61::clear_extended_program_banks();
  const u8 clear_segments[] = {
      0x2F, 0x01, 0x2F, 0x2A, 0x07, 0x2F, 0x0D, 0x50};
  run_program(clear_segments, sizeof(clear_segments));
  frame = core_61::segment_display_frame();
  bool all_blank = frame != nullptr;
  for(u8 index = 0; frame != nullptr && index < 12; ++index)
    all_blank &= frame[index] == 0;
  check_true("segment clear stays blank",
      all_blank && !core_61::extended_display_auto());
  check_near("segment clear leaves X", read_live_x(), 7.0, 1e-8);

  core_61::enable();
  core_61::clear_extended_program_banks();
  const u8 clear_and_resume[] = {
      0x2F, 0x50, 0x2F, 0x0D, 0x2F, 0x52, 0x07, 0x50};
  run_program(clear_and_resume, sizeof(clear_and_resume));
  check_true("numeric display resumes", core_61::extended_display_auto());
  check_near("resume follows X", read_live_x(), 7.0, 1e-8);
}

