bolknote/MK61S_MINI/tests/mk_math_self_test.cpp
static double first_random(bool enhanced, u32 seed) {
  const MatrixKey key_k = {10, 9};
  const MatrixKey key_bx = {11, 8};
  core_61::configure_random_seed(enhanced, seed);
  core_61::enable();
  press_matrix(key_k);
  press_matrix(key_bx);
  return read_live_x();
}

static double next_random(void) {
  press_matrix({10, 9});
  press_matrix({11, 8});
  return read_live_x();
}

static void test_random_seed_hook(void) {
  std::printf("calculator random seed hook:\n");

  const double authentic_a = first_random(false, 1234567);
  const double authentic_b = first_random(false, 7654321);
  check_near("MK61 repeat", authentic_a, authentic_b, 0.0);

  const double enhanced_a = first_random(true, 1234567);
  const double enhanced_b = first_random(true, 7654321);
  check_true("seed changes RNG", std::fabs(enhanced_a - enhanced_b) > 1e-8);
  check_true("RNG in [0,1)", enhanced_a >= 0.0 && enhanced_a < 1.0 &&
                                  enhanced_b >= 0.0 && enhanced_b < 1.0);

  core_61::configure_random_seed(true, 2468135);
  core_61::enable();
  check_true("enhanced mode enabled", core_61::random_seed_enabled());
  press_matrix({4, 1}); // обычная клавиша 2 не должна раскрывать скрытый поток
  check_near("ordinary key unchanged", read_live_x(), 2.0, 1e-8);

  // Математический вызов CORE арендует и внутренне сбрасывает эмулятор. Его
  // снимок должен также сохранять позицию внешнего потока.
  core_61::configure_random_seed(true, 11223344);
  core_61::enable();
  const double before_math = next_random();
  (void) mk_math::sin(1.0);
  const double after_math = next_random();

  core_61::configure_random_seed(true, 11223344);
  core_61::enable();
  const double reference_first = next_random();
  const double reference_second = next_random();
  check_near("math keeps RNG first", before_math, reference_first, 0.0);
  check_near("math keeps RNG stream", after_math, reference_second, 0.0);

  // Штатное ПЗУ выдавало лишь 179 разных значений (префикс из 26 значений и
  // цикл из 153). Улучшенный режим не должен наследовать этот короткий повтор;
  // допускаем несколько коллизий дней рождения в 7-разрядном пространстве.
  core_61::configure_random_seed(true, 99887766);
  core_61::enable();
  static constexpr int SAMPLE_COUNT = 256;
  u32 values[SAMPLE_COUNT] = {};
  int unique = 0;
  for(int i = 0; i < SAMPLE_COUNT; i++) {
    const u32 value = (u32) std::llround(next_random() * 10000000.0);
    bool seen = false;
    for(int j = 0; j < unique; j++) seen |= values[j] == value;
    if(!seen) values[unique++] = value;
  }
  check_true("no native short cycle", unique > 240);

  // Встроенный распознаватель ГСЧ работает после внешних обратных вызовов BEFORE
  // и следует итоговому коду замены. Замена 3B на NOP не должна ни подставлять
  // значение, ни продвигать поток.
  static constexpr u32 REPLACEMENT_SEED = 3141592;
  core_61::configure_random_seed(true, REPLACEMENT_SEED);
  core_61::enable();
  set_x_bcd(0x00000007U);
  CommandHookProbe suppress_rng = {};
  suppress_rng.replace = true;
  suppress_rng.replacement = (u8) MK61_NOP;
  const core_61::Mk61CommandHookHandle suppress_rng_handle =
      core_61::register_mk61_command_hook(
          0x3B, core_61::Mk61CommandHookPhase::BEFORE_EXECUTE,
          &command_hook_probe, &suppress_rng);
  (void) next_random();
  check_near("3B->NOP keeps X", read_live_x(), 7.0, 1e-8);
  check_true("remove RNG suppression",
      core_61::unregister_mk61_command_hook(suppress_rng_handle));
  const double after_suppressed = next_random();
  const double unsuppressed_reference = first_random(true, REPLACEMENT_SEED);
  check_near("3B->NOP keeps RNG stream", after_suppressed, unsuppressed_reference, 0.0);

  // И наоборот, замена другой команды на 3B должна взвести ту же однократную
  // подстановку A7, которая используется штатной командой K RNG.
  static constexpr u32 REDIRECTED_SEED = 2718281;
  core_61::configure_random_seed(true, REDIRECTED_SEED);
  core_61::enable();
  CommandHookProbe redirect_to_rng = {};
  redirect_to_rng.replace = true;
  redirect_to_rng.replacement = 0x3B;
  const core_61::Mk61CommandHookHandle redirect_handle =
      core_61::register_mk61_command_hook(
          0xD7, core_61::Mk61CommandHookPhase::BEFORE_EXECUTE,
          &command_hook_probe, &redirect_to_rng);
  press_kip7();
  const double redirected_random = read_live_x();
  check_true("D7->3B produces RNG value",
      redirected_random >= 0.0 && redirected_random < 1.0);
  check_true("remove D7->3B redirect",
      core_61::unregister_mk61_command_hook(redirect_handle));
  const double redirected_reference = first_random(true, REDIRECTED_SEED);
  check_near("D7->3B uses enhanced seed", redirected_random, redirected_reference, 0.0);

  core_61::configure_random_seed(false, 1);
  check_true("enhanced mode disabled", !core_61::random_seed_enabled());
}

static void test_core_boundaries(void) {
  std::printf("core boundary regressions:\n");
  core_61::set_expanded_program_mode(false);
  core_61::enable();

  m_IK1302.comma = core_61::COMMA_RUN_POSITION;
  const char* run_indicator = MK61Emu_GetIndicatorStr(SYMBOLS);
  check_true("RUN indicator bounded", std::strlen(run_indicator) < INDICATOR_STRING_LENGTH);
  check_true("GetComma exported", MK61Emu_GetComma() == core_61::COMMA_RUN_POSITION);

  char update_buffer[INDICATOR_STRING_LENGTH + 2];
  std::memset(update_buffer, 0, sizeof(update_buffer));
  update_buffer[INDICATOR_STRING_LENGTH] = 'A';
  update_buffer[INDICATOR_STRING_LENGTH + 1] = 'B';
  core_61::update_indicator(update_buffer, SYMBOLS);
  check_true("update indicator bounded",
    update_buffer[INDICATOR_STRING_LENGTH] == 'A' &&
    update_buffer[INDICATOR_STRING_LENGTH + 1] == 'B');

  m_IK1302.comma = 10;
  check_true("left comma bounded", std::strlen(MK61Emu_GetIndicatorStr(SYMBOLS)) < INDICATOR_STRING_LENGTH);

  char valid_mantissa[8] = {'1','2','3','4','5','6','7','8'};
  char invalid_mantissa[8] = {'1','2','3','x','5','6','7','8'};
  u8 ring_before[SIZE_RING_M];
  std::memcpy(ring_before, ringM, sizeof(ringM));
  check_true("reject exponent +100", !write_stack_register(stack::X, ' ', valid_mantissa, 100));
  check_true("reject exponent -100", !write_stack_register(stack::X, ' ', valid_mantissa, -100));
  check_true("reject bad BCD digit", !write_stack_register(stack::X, ' ', invalid_mantissa, 0));
  check_true("rejection is atomic", std::memcmp(ring_before, ringM, sizeof(ringM)) == 0);

